// 2) გამოიტანე კონსოლში შემდეგი მოქმედებების პასუხები: 10 - 3 4 × 6 20 ÷ 5 
console.log(10 - 3);   // 7
console.log(4 * 6);    // 24
console.log(20 / 5);   // 4
// 3) კონსოლში დაბეჭდე შენი სახელი და გვარი 
console.log("Juba Maxaradze");
// 4) გააკეთეთ თითო მათემატიკურ ოპერაციაზე 3-3 მაგალითი, სასურველია რომ ყველა მათემატიკურ ოპერაციაში იყოს გამოყენებული რიცხვი 10 
// დამატება
console.log(10 + 5);
console.log(10 + 20);
console.log(10 + 1);

// გამოკლება
console.log(10 - 2);
console.log(10 - 7);
console.log(10 - 10);

// გამრავლება
console.log(10 * 2);
console.log(10 * 5);
console.log(10 * 0);

// გაყოფა
console.log(10 / 2);
console.log(10 / 5);
console.log(10 / 10);


// 5)კომენტარის სახით ახსენით დღეს ახსნილი მასალა დეტალურად (რა არის js, რაში ვიყენებთ, რა არის console, რა ხდება სტრინგნის და ინტეჯერის მიმატებისას და ასე შემდეგ ეხლა ეს ჯავა სკრიპტი

// JavaScript (JS) არის პროგრამირების ენა, რომელსაც ვიყენებთ ვებსაიტების შესაქმნელად.
// ის აძლევს საიტს “ცოცხალ” ფუნქციებს — მაგალითად ღილაკებზე დაჭერა, ანიმაციები და ლოგიკა.

// console არის ადგილი, სადაც ვხედავთ ჩვენი კოდის შედეგებს.
// მაგალითად console.log() გამოიყენება იმისთვის, რომ დავბეჭდოთ ინფორმაცია კონსოლში.

// string არის ტექსტი (მაგ: "hello")
// integer (number) არის რიცხვი (მაგ: 5, 10, 100)

// თუ string-ს და number-ს დავუმატებთ:
// მაგალითად: "5" + 5
// შედეგი იქნება "55"
// რადგან JavaScript number-ს გადააქცევს string-ად და შეაერთებს (concatenation)

// თუ გვინდა ნამდვილი მათემატიკა, ორივე უნდა იყოს number:
// მაგალითად: 5 + 5 = 10