#1) კომენტარის სახით ჩამოთვალეთ mutable და immutable მონაცემთა ტიპები.

#immutabe - list
#mutable - str, int, float,boolian


#2) შექმენით სია 20 ელემენტით და შემდგომ მეათე და მეჩვიდმეტე ელემენტები ჩაანაცვლეთ რაიმე რიცხვებით. (გამოიყენეთ უარყოფითი ინდექსები).

int1[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

int1[-4] = 10

int1[-11] = 17

#3) ცვლადში შეინახეთ რაიმე სტრინგი და შემდგომ ინდექსინგით შეუცვალეთ მესამე და მეხუთე ადგილზე მყოფი ასოები.


#str არის - immutable


#4) ცვლადში შეინახეთ რაიმე password შემდეგ მომხმარებელს იქამდე შემოაყვანინეთ  პაროლი სანამ არ დაემთხვევა ნამდვილ პაროლს, და საბოლოოდ როცა სწორად შეიყვანს გამოუტანეთ: "თქვენ წარმატებით ჩაწერეთ პაროლი".


passsword = "jubajuba1234435"

user_input = input("enter your password: ")

while user_input != password:
    print("არასწორია გთხოვთ ცადოთ კიდევ.")
    user_input = input("enter your password: ")

print("თქვენ წარმატებით შეიყვანეთ პაროლი")

#5) while loop-ის დახმარებით გამოიტანეთ ყველა ლუწი რიცხვი 40 დან 10მდე.

num = 40
while num != 10:
    print(num)
    num = num + 2




