#1) კომენტარის სახით ახსენით რა არის დეკლარირება

#დეკლარირება ნიშნავს პროგრამაში თქმა


#2) შექმენით 2 ცვლადი name და surname შემდეგ კი მომხმარებელს შემოატანინეთ თავისი სახელი და გვარი ბოლოს კი გამოიტანეთ მოხმარებლის სახელი და გავარი ერთად

name =input("enter your name: ")
surname= input("enter your surname: ")

print(name, surname)


#3) შექმენით ცვლადი, სახელად points, რომელიც თავიდან უდრის 50, შემდეგ დაა-update-ეთ ამ ცვლადის მნიშვნელობა, რამოდენიმეჯერ. საბოლოოდ კი დაპრინტეთ ეს ცვლადი


points = 50 
points = 100
points = 150

print(points)


#4) გაასწორეთ შემდეგი კოდი:
     #1age == 156
     #print(("1age)

age1 = 156
print(age1)


#5) დაწერეთ პროგრამა, რომელიც შეიცავს ორ integer ტიპის ცვლადს (მაგალითად, a და b), შემდეგ გამოიანგარიშეთ ამ ცვლადების ჯამი, სხვაობა, ნამრავლი და განაყოფი. 


a = 100
b = 50

print(a + b)
print(a - b)
print(a * b)
print(a / b)


#6) დაწერეთ კოდი შეცდომებით და ქვემოთ მიუწერეთ მისი სწორი ვერსია.

#1num = 60
#print((1num))

num1 = 60 
print(num1)



