#1) შექმენით ცვლადი name სადაც გექნებათ თქვენი სახელი ხოლო, შემდეგ განაახლეთ ამ ცვლადის მნიშვნელობა
name = "juba"
name = "vano"



#2) print ფუნქციის გამოყენებით მოახდინეთ მათემატიკური ოპერაციები დღევანდელი ნასწავლი მასალით. მიმატება გამოკლება გამრავლება და გაყოფა

num1 = 20
num2 = 10

print(num1 + num2)
print(num1 - num2)
print(num1 * num2)
print(num1 / num2)

#3) შექმენით ცვლადი სახელად num ამ ცვლადში შეინახეთ თქვენთვის სასურველი რიცხვი. და მაგ რიცხვის მნიშვნელობას დაემატოს ( 1 ) თუ არის 10 გახდეს 11
 

num = 20
print(num + 1)


#4) კომენტარების სახით ახსენით არის თუ არა სასარგებლო ცვლადის, განახლება და თუ ფიქრობთ რომ კი მაშინ რატომ?

# ცვლადის განახლება ძალიან კარგია რადგან თუ გინდა გამოიყენო ორი ერთი და იგივე თემის ინფორმაცია ჯერ შეინახავ ნორმალურად და იმას გამოიყენებ შემდეგ კიდე გაანახლებ და ახალ ინფორმაციას გამოიყენებ


