#1) შექმენით ფუნქცია რომელსაც გადასცემთ ერთ პარამეტრს age 'ს თუ age აღემატება 18 მაშინ დაპრინტეთ "შენ ხარ სრულწლოვანი" სხვაშემთხვევაში "შენ არხარ სრულწლოვანი"

age = int(input("enter your age:  "))
if age > 18:
    print("შენ ხარ სრულწლოვანი")
else:
    print("შენ არ ხარ სრულწოვანი")

#2) კომენტარის სახით ახსენით რას ნიშნავს და რაში გამოიყენება if-else სთეითმენთი 

#if else სთეითმენტი გამოიყენება იმისთვის რომ პროგრამამ გადაწყვეტილება მიიღოს

#3) კომენტარის სახით ახსენით while loop'ები 

#while loop - გააკეთებს მოქმედებას იქამდე შეასრულებს სანამ მოცემული პირობა ჭეშმარიტია 

#4) while loop ის დახმარებით გამოიტანეთ რიცხვები 100 დან 0 'ის ჩათვლით 

num1 = 0
while num1 < 100:
    print(num1)
    num1 = num1 + 1

#5) შექმენით ცვლადი სადაც მომხმარებელს შემოატანინებთ მის ასაკს თუ მისი ასაკი აღემატება ან ტოლია 18 მაშინ დაპრინტეტ "თქვენ გადაიხდით რეგულარული ფასებით" სხვა შემთხვევაში დაპრინტეთ "თქვენ მიიღეთ 20% ფასდაკლება"

age2 =int(input("enter your age:  "))
if age2 >= 18:
    print("თქვენ გადაიხდით რეგულარული ფასებით")
else:
    print("თქვენ მიიღეთ 20% ფასდაკლება")