# 1)
# შექმენით სია რიცხვებით და დაწერე კოდი, რომელიც გამოითვლის სიის ყველა ელემენტის ნამრავლს და დაბეჭდავს შედეგს.

numbers = [2, 3, 4, 5]
product = 1

for n in numbers:
    product *= n

print(product)


# 2)
# შექმენით სია სადაც იქნება 10 ელემენტი
# გამოიტანეთ მე-0 ინდექსიდან მე-8 ინდექსის ჩათვლით ყველა ელემენტი.

lst = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(lst[0:9])


# 3)
# შექმენით სია სადაც იქნება ხუთი რიცხვი
# გადაუარეთ ამ სიას for ციკლის საშუალებით
# თუ რომელიმე რიცხვი ნაკლებია 5-ზე, დაბეჭდეთ ის რიცხვი.

nums = [1, 4, 6, 3, 8]

for i in nums:
    if i < 5:
        print(i)


# 4)
# მომხმარებელს შემოატანინეთ მისი სახელი დიდი ასოებით
# შეინახეთ ცვლადში name და .lower() ფუნქციით გადააქციეთ პატარა ასოებად.

name = input("ENTER NAME IN CAPS: ")
print(name.lower())


# 5)
# ცვლადში შეინახეთ თქვენი გვარი პატარა ასოებით
# .upper() ფუნქციით გადააქციეთ დიდ ასოებად.

surname = "maxaradze"
print(surname.upper())


# 6)
# ცვლადში შეინახეთ სტრინგი პატარა ასოებით
# .capitalize() ფუნქციით გადააქციეთ პირველი ასო დიდ ასოდ.

text = "hello world"
print(text.capitalize())


# 7)
# შექმენით ფუნქცია რომელსაც არგუმენტად გადაეცემა ორი რიცხვი
# და გამოიტანეთ ამ რიცხვების ჯამი.

def sum_numbers(a, b):
    print(a + b)

sum_numbers(5, 7)


# 8)
# შექმენით ფუნქცია რომელსაც არგუმენტად გადაეცემა რიცხვი
# და დააბრუნებს ლუწია თუ კენტი.

def even_or_odd(num):
    if num % 2 == 0:
        return "ლუწია"
    else:
        return "კენტია"

print(even_or_odd(4))


# 9)
# შექმენით ფუნქცია რომელსაც არგუმენტად გადაეცემა რიცხვი
# და დააბრუნებს დადებითია თუ უარყოფითი.

def positive_or_negative(num):
    if num >= 0:
        return "დადებითია"
    else:
        return "უარყოფითია"

print(positive_or_negative(-3))


# 10)
# შექმენით ფუნქცია რომელსაც არგუმენტად გადაეცემა სახელი
# და დაბეჭდავს მისთვის მისალმებას.
# გამოიძახეთ ფუნქცია 2-ჯერ სხვადასხვა სახელით.

def greet(name):
    print("Hello", name)

greet("Giorgi")
greet("Nika")
