#2) მომხმარებელს შემოატანინეთ სიტყვა, შემდეგ if-ით შეამოწმეთ ეს სიტყვა თუ თავისი თავის ტოლია როდესაც შემოაბრუნებთ (slicing-ის დახმარებით), თუ ასეა დაბეჭდეთ რომ განსაკუთრებული (ასეთ სიტყვებს palindrome ჰქვია) სიტყვაა, სხვა შემთხვევაში კი დაბეჭდეთ რომ ჩვეულებრივი სიტყვაა.

str1 = "racecar"
reverse_str1 = name[::-1]

if reverse_str1 == str1:
    print("your word is different one")

else:
    print("your name is just ordinary")


#3) შექმენით სიტყვების სია, შემდეგ მის შემობრუნებულ ვერსიას გადაუარეთ for ციკლით, დაბეჭდეთ ყოველი მეორე ელემენტი (რომ გაიგოთ ყოველი მეორე აიღეთ ცვლადი რომელიც თავიდან 0 იქნება, ყოველ გამეორებაზე კი გაზრდით ერთით და შეამოწმეთ ლუწია თუ კენტი)

int1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
reverse_int1 = int1[::-1]

num = 0
for i in reverse_int1:
    print(i)
    num += 1
    if num % 2 == 0:
        print("num is even")
    else:
        print("num is odd")

#4) მომხმარებელს შემოატანინეთ სიტყვა და დაბეჭდეთ ის შებრუნებულად

something = input("enter some word: ")
print(something[::-1])

#5) შექმენით ცვლადი რომელშიც შეინახავთ თქვენთვის სასურველ string-ს, უნდა იყოს მინიმუმ 20 სიმბოლო, შემდეგ slicing-ის საშვალებით დაბეჭდეთ ეს string ხუთგვარად შემდეგი პირობებით:
#  - მხოლოდ პირველი 5 სიმბოლო
#  - ბოლო 4 სიმბოლო
#  - შუა ნაწილი მეოთხე სიმბოლოდან მეათემდე
#  - მთელი სტრინგი შებრუნებულად
#  - სტრინგი ამოჭრილი ყოველ მეორე სიმბოლოზე

str1 = "goa_is_the_beeeeeest"

print(str1[:6])
print(str1[-4:])
print(str1[::-1])
print(str1[::2])


