#2) დაწერეთ დღეს ნასწავლი ყველა მონაცემთა ტიპი.
#integer, float and string

#3) მომხმარებელს შემოატანინეთ რიცხვი და გადააქციეთ ინტეჯერად.
num = input("type number")
num = int(num)
#4) მომხმარებელს შემოატანინეთ რიცხვი და დაბეჭდეთ მისი მონაცემთა ტიპი.

num1 = input("enter random number")
print(type(num1))

#5) შექმენით ცვლადი სადაც შეინახავთ თქვენს სახელს შემდეგ მომხმარებელს შემოატანინეთ თავისი სახელი და თქვენს ცვლადს დაუმატეთ მომხმარებლის შემოტანილი სახელი.
name = "juba"
name2 = input("enter your name")
print(name + name2)

#6) მომხმარებელს შემოატანინეთ რიცხვი რომელსაც გადააქცევთ ინტეჯერათ და გაყოფთ 2 ზე შემდეგ კი დაპრინტეთ ეს რიცხვი.

num2 = input("enter number")
num2 = int(num2)
result = num2 / 2
print(result)

#7) შექმენით ცვლადი სადაც შეინახავთ თქვენს სახელს შემდეგ მომხმარებელს შემოატანინეთ რიცხვი ინტეჯერის სახით და თქვენი სახელი გაამრავლეთ ამ რიცხვზე.

name = "juba"
num3 = input("enter number")
num3 = int(num3)
print(name * num3)

