#1) კომენტარით ახსენით როგორ მუშაობს ინდექსინგი.
#ინდექსი არ აღნიშნავს რამდენი ელემენტია გამოყენებული ის იწყება 0 და თუ არ ვიცით რამდენი ინდექსი გვაქ და გვინდა ბოლოს გამოტონა მაშინ დავწერთ -1

#2) შექმენით სია 10 ელემენტით და გამოიტანეთ ბოლო და ბოლოსწინა ელემენტები.
int1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

print(int1[0])
print(int1[-2])

#3) მომხმარებელს შემოატანინეთ რიცხვი 0დან 10მდე, შემდეგ შექმენით სია 11 ელემენტით, თუ შემოტანილი რიცხვი ამ დიაპაზონში იქნება მაშინ, გამოიყენეთ ეს რიცხვი როგორც ინდექსი, და ამ ინდექსზე მყოფი ელემენტი დააupdateთ რაიმე სხვა მონაცემით.

user_input = int(input("enter number from 0 to 10:"))

numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 0]

if user_input <= 10:
    numbers[user_input] = 12

else:
    print("you choose wrong number")

#4) შექმენით სია 5 ელემენტით, შემდეგ მას გადაუარეთ for loopით და გამოიტანეთ ყველა სიაში მყოფი ელემენტი (როგორც გაკვეთილზე გავაკეთეთ).

names = ["juba", "gio", "vano", "Dato", "nika"]

for i in names:
    print(i)

#5) შექმენით სია 8 ელემენტით და მე3 და მე7 ელემენტები შეცვალეთ სიის გარედან, (upadte-ით)

str1 = ["word", "table", "hand", "hard", "small", "big", "chair", "laptop"]

str1[2, 6] = "foot":"stand" 


